import re


def detect_abbreviations(matches):
    # Регулярное выражение для поиска аббревиатур
    regex = r'\b[A-ZА-Я]{2,}\b'

    # matches = re.findall(regex, text)
    translities = {'A': ['эй', 'э'], 'B': ['бэ'], 'C': ['эс'], 'D': ['дэ'], 'E': ['е'], 'F': ['эф'], 'G': ['жэ'],
                   'H': ['аш', 'эйч'], 'I': ['ай'], 'J': ['джей', 'джи'], 'K': ['кэ', 'ка'], 'L': ['эл'], 'M': ['эм'],
                   'N': ['эн', 'нэ'], 'O': ['о'], 'P': ['пи', 'пэ'], 'Q': ['кью'], 'R': ['рэ', 'ар'], 'S': ['эс', 'сэ'],
                   'T': ['тэ'], 'U': ['ю', 'у'], 'V': ['вэ'], 'W': ['дабл-ю', 'вэ'], 'X': ['икс'], 'Y': ['игрик'],
                   'Z': ['зэ'], 'А': ['а'], 'Б': ['бэ'], 'В': ['вэ'], 'Г': ['гэ'], 'Д': ['дэ'], 'Е': ['е'], 'Ё': ['ё'],
                   'Ж': ['жэ'], 'З': ['зэ'], 'И': ['и'], 'Й': ['йэ'], 'К': ['ка', 'кэ'], 'Л': ['лэ', 'эл'],
                   'М': ['эм', 'мэ'], 'Н': ['нэ', 'эн'], 'О': ['о'], 'П': ['пэ'], 'Р': ['эр', 'рэ'], 'С': ['эс', 'сэ'],
                   'Т': ['тэ'], 'У': ['у'], 'Ф': ['фэ', 'эф'], 'Х': ['хэ'], 'Ц': ['цэ'], 'Ч': ['чэ'], 'Ш': ['шэ'],
                   'Щ': ['ща', 'ще'], 'Ъ': [''], 'Ь': [''], 'Ы': ['ы'], 'Э': ['э'], 'Ю': ['ю'], 'Я': ['я']}
    result = []
    dict = {}
    for word in matches:
        words = [translities[word[0]][i] for i in range(len(translities[word[0]]))]
        for letter in word[1:]:
            length = len(words)
            temp_words = []
            for k in range(length):
                for i in range(len(translities[letter])):
                    temp_words.append(words[k] + translities[letter][i])
                    dict[temp_words[-1]] = word
            words = temp_words.copy()
        result.append(words)
    print(dict)
    return list(set([item for sublist in result for item in sublist]))


abb = ['ППУ', 'РБ', 'КПД', 'ИПЛЭ', 'ЦВС', 'БПД', 'ВПЖ', 'РЗВ', 'БЗС', 'ПКС', 'БВР', 'ФШ', 'ЦМ', 'ГК', 'ЭРД', 'ЛК',
       'БТО', 'КИ', 'ОМЗ', 'СМЕТ', 'РДМ', 'ПНКВ', 'ВИП', 'SF', 'УТ', 'ФНД', 'ТРМ', 'РВ', 'ПЧ', 'ТС', 'КП', 'ПЭКМ', 'БС',
       'QP', 'ЭВМ', 'ТОП', 'ККМ', 'РУЗ', 'МН', 'ОМ', 'САРТ', 'ЭМОД', 'БЭЛ', 'MPU', 'ШК', 'РШК', 'РК', 'СРН', 'БЦВ',
       'ПЗП', 'ADD', 'CAN', 'МТО', 'ПТС', 'СР', 'ДП', 'КВЦ', 'ПТ', 'ДГ', 'ПТБ', 'УСТА', 'БП', 'РНВГ', 'ЗБ', 'БЖТ',
       'КБУ', 'ТЯГИ', 'РОП', 'БВА', 'СОТ', 'ЗСУ', 'КДК', 'ДНЦ', 'НН', 'МКС', 'ЕСАУП', 'БСП', 'СГП', 'ОАО', 'РСМД', 'ПУ',
       'ЦТ', 'РДФ', 'РДТ', 'ТА', 'КМ', 'БР', 'РСР', 'KS', 'СТ', 'РЧО', 'ГУ', 'ВУВ', 'ПВИ', 'ПИНТ', 'ГР', 'БАРС', 'ПВСК',
       'РВЗ', 'ПРБ', 'БОДД', 'СК', 'ALSTOM', 'ВА', 'АСТ', 'АК', 'ДВС', 'ЗИП', 'II', 'ВПР', 'ПС', 'ПД', 'БУВ', 'СН',
       'ВКА', 'ВБ', 'КТ', 'ДМ', 'ВТПП', 'ПСУ', 'ЭКГ', 'ОРМ', 'ПК', 'БПБ', 'ВЗУ', 'МИСК', 'ИТ', 'БУП', 'ПБЗ', 'ВОД',
       'ТГ', 'МПК', 'ТЭМ', 'УТОЛ', 'МВ', 'КТО', 'ЛБС', 'OMI', 'БКС', 'ШП', 'ЭЛТ', 'СВВ', 'ДД', 'ДЗБ', 'ВТ', 'ПМ', 'КПЗ',
       'ЭДТ', 'АЗВ', 'РЩ', 'ТР', 'АКРВ', 'МВП', 'БУО', 'ТУ', 'КВ', 'QT', 'ТЦ', 'БСК', 'БВС', 'ТСМ', 'СГ', 'СМД', 'КД',
       'ГТЭКМ', 'САУТ', 'БРН', 'КНП', 'ВЦУ', 'ВПУ', 'БМ', 'БПР', 'ФТО', 'ТО', 'БРД', 'СПСТ', 'БИО', 'ТКП', 'ВЗ', 'ЧС',
       'ХП', 'СМЕ', 'ВПС', 'ДЛ', 'МСУЛ', 'ГТУ', 'RЗБ', 'MTU', 'РЗ', 'ЦУ', 'ТЭД', 'КМЗ', 'ДДМ', 'НЧ', 'ШНА', 'ВРЗ',
       'АБТ', 'АР', 'УТП', 'АИНЗ', 'ЩПР', 'БПСН', 'РШ', 'СПВ', 'РКЗ', 'КВГ', 'МС', 'УНИПУЛЬС', 'РОТ', 'КВТ', 'ПАВЗ',
       'ВДУ', 'ПСЗ', 'ПУМ', 'ПБК', 'УО', 'РУ', 'МПСУ', 'БГП', 'KLIP', 'АВ', 'СУД', 'КЗ', 'БВГ', 'БУЭ', 'УОИ',
       'КШ', 'УР', 'БПА', 'ТП', 'ЭСУТ', 'ОТ', 'ДТ', 'БВК', 'ЗР', 'КА', 'БПО', 'ХОД', 'ЭЧ', 'РД', 'ЭТ', 'РВНГ', 'СП',
       'ФГО', 'БВТ', 'БВУ', 'УКЦ', 'РПТ', 'ИП', 'УКТОЛ', 'КВВ', 'ПРТ', 'ТЯГА', 'СПСВ', 'РВД', 'КМР', 'ПЦУ', 'САВ',
       'МАП', 'ПО', 'КРН', 'KB', 'ФГОТ', 'ТМ', 'ПЧТ', 'РСДМ', 'ККЗ', 'АБ', 'КПР', 'ТРВ', 'ОП', 'РЗН', 'КТН', 'БПТР',
       'АВУ', 'ДТПМ', 'ПШ', 'РАВ', 'РЦ', 'КМБ', 'МВЗ', 'DDU', 'КДМ', 'ТЧМП', 'МСУТ', 'АИН', 'ШБВ', 'ЭПВ', 'АМК', 'ЦЭ',
       'ВР', 'ПТО', 'ПТР', 'ПТИ', 'ЭПВН', 'АТН', 'СС', 'ТТ', 'ФТОТ', 'ГГ', 'БАУ', 'ПЧФ', 'УК', 'ПР', 'УВВ', 'КУ',
       'ДНБС', 'ВБТ', 'БН', 'РМ', 'ЦКР', 'ОД', 'ПТОЛ', 'ЭМН', 'ТК', 'ПКГ', 'ЭД', 'КЗЗ', 'DJ', 'ПСН', 'ДГУ', 'КУДК',
       'ДЧВ', 'ВСТ', 'КМВХ', 'БИ', 'ВУ', 'ЩР', 'ВЛ', 'АЛСН', 'БУК', 'АПУ', 'ВКБ', 'КМВ', 'СТК', 'АРН', 'КАЭТ', 'ФР',
       'QS', 'РВИ', 'БА', 'FЗ', 'ВП', 'SA', 'БТК', 'КНПД', 'ВВК', 'БОАД', 'РН', 'РМТ', 'ASG', 'ВВ', 'ТУП', 'ТН', 'РП',
       'РШЗ', 'СМ', 'БУТП', 'КСП', 'РММ', 'ПВАД', 'МУВ', 'КБ', 'БЭПП', 'ТАСС', 'ПП', 'ВКЛ', 'ATSA', 'КТМ', 'БЗ',
       'РС', 'ДСП', 'ТИ', 'IV', 'ВПП', 'ФТОК', 'ЗУ', 'КН', 'ОРД', 'ХХ', 'РДК', 'ВМ', 'КМН', 'ВШ', 'БК', 'РТ', 'ЭПС',
       'VS', 'ПВДД', 'БСА', 'ИПЦУ', 'ТНА', 'БД', 'ДПС', 'VI', 'БУГС', 'МСУД', 'КМЭ', 'ПЖ', 'БВ', 'KV', 'КРУ', 'ВВУ',
       'КС', 'СУ', 'ТД', 'ПВА', 'РИФ', 'ВЭ', 'ЛЭ', 'КЭБ', 'ШР', 'СУЭ', 'САВП', 'КМРЗ', 'МЯП', 'РДВ', 'ТНВД', 'РКВ',
       'БВЗ', 'НР', 'SI', 'VII', 'МСУ', 'ЭПК', 'KM', 'ГП', 'СТПР', 'ТРТ', 'ПУА', 'НЭ', 'ФП', 'САУ', 'QF', 'НМ', 'ППЦУ',
       'СИ', 'ЮЗА', 'РЖД', 'ВСПОМ', 'ИД', 'ГВ', 'ОЖ', 'БПУ', 'ПСМЕ', 'ТРПШ', 'БУ', 'ПДВВ', 'УБТ', 'ГМР', 'ВО', 'ЭПТ',
       'ВГ', 'МК', 'УСО', 'ИПБС', 'УВ', 'ПРА', 'ШВА', 'ПРВГ', 'NN', 'ДР']
with open('Аббревиатуры_плоско.txt', 'w', encoding='utf-8') as file:
    for i in detect_abbreviations(abb):
        file.write(i + '\n')
